In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

In [4]:
df.describe() #숫자로된 데이터만 가능

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [6]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## count()

In [7]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [8]:
df['age'].count()

np.int64(714)

### mean()

In [10]:
arr = np.arange(15).reshape(3, 5)
temp_df = pd.DataFrame(arr)
temp_df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [11]:
temp_df.mean()

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [13]:
df.mean(numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [14]:
df['age'].mean()

np.float64(29.69911764705882)

In [15]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [16]:
cond = df['adult_male'] == True
df.loc[cond, 'age'].mean()

np.float64(33.17312348668281)

- fare를 30이상 40미만 지불한 승객
- pclass 1등급

=> 나이 평균 / count

In [23]:
cond1 = df['fare'] < 40
cond2 = df['fare'] >= 30
cond3 = df['pclass'] == 1
df.loc[cond1 & cond2 & cond3, 'age'].mean()

np.float64(44.095238095238095)

In [24]:
df.loc[cond1 & cond2 & cond3, 'age'].count()

np.int64(21)

In [26]:
df.loc[cond1 & cond2 & cond3, 'age'].describe()

count    21.000000
mean     44.095238
std      17.276877
min      16.000000
25%      29.000000
50%      47.000000
75%      56.000000
max      80.000000
Name: age, dtype: float64

In [29]:
df.mean(numeric_only=True, skipna=False)

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

### median

In [30]:
pd.Series([1, 2, 3, 4, 9]).median()

np.float64(3.0)

In [32]:
pd.Series([1, 2, 3, 4, 9]).mean()

np.float64(3.8)

In [33]:
pd.Series([1, 2, 3, 4, 5, 6]).median()

np.float64(3.5)

In [35]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_value)

29.69911764705882 28.0

### sum

In [37]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [39]:
df['fare'].sum()

np.float64(28693.9493)

In [40]:
df['fare'].cumsum()

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [42]:
df['age'].cumprod()

/Users/june/.pyenv/versions/3.12.4/lib/python3.12/site-packages/numpy/_core/fromnumeric.py:57: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

### var (분산)

In [47]:
# 평균
fare_mean = df['fare'].values.mean()

total = ((df['fare'].values - fare_mean) ** 2).sum()
total_count = df['fare'].count() - 1
my_var = total / total_count
my_var

np.float64(2469.436845743116)

In [49]:
df['fare'].var()

np.float64(2469.436845743116)

### std (표준편차)

In [51]:
np.sqrt(df['fare'].var())

np.float64(49.6934285971809)

In [52]:
df['fare'].std()

np.float64(49.6934285971809)

### min(), max()

In [55]:
df['age'].min()

np.float64(0.42)

In [56]:
df['age'].max()

np.float64(80.0)

### agg

In [57]:
df['age'].agg(['mean', 'std'])

mean    29.699118
std     14.526497
Name: age, dtype: float64

In [59]:
df[['age', 'fare']].agg(['mean', 'count', 'min', 'max'])

              age        fare
mean    29.699118   32.204208
count  714.000000  891.000000
min      0.420000    0.000000
max     80.000000  512.329200

### quantile (분위)

In [60]:
df['age'].quantile(0.1)

np.float64(14.0)

In [62]:
df['age'].quantile(0.5)

np.float64(28.0)

### unique

In [64]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [65]:
df['who'].nunique()

3

### mode

In [68]:
df['who'].mode()

0    man
Name: who, dtype: object

In [69]:
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

### corr
- -1 ~ 1 까지의 값. -1에 가까워질 수록 반비례, 1에 가까워질 수록 정비례

In [71]:
df.corr(numeric_only=True) # 상관관계를 보여준다

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [73]:
df.corr(numeric_only=True)['survived'] #adult_male에 가까워질 수록 생존확률이 적어지고, adult_male에 멀어질 수록 생존확률이 늘어난다.

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64